In [1]:
import pandas as pd

In [5]:
# Sort 

# select * from table 
# order by column_name


df = pd.DataFrame({"Id":range(5),'Name':['d','b','c','d','a']})
df.sort_values(by='Name',ascending=False)

   Id Name
0   0    d
3   3    d
2   2    c
1   1    b
4   4    a

In [11]:
data = pd.read_csv('Data/vgsalesGlobale.csv')
data.columns

Index(['Rank', 'Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [18]:
data[['Year','Genre','Global_Sales']]
# select year,Genre,Sum(Global_Sales) from table group by year,Genre
grouped_data_by_year = data.groupby(['Year','Genre'], as_index= False).agg(Total_sales = ('Global_Sales','sum'))

In [19]:
print(grouped_data_by_year)

       Year         Genre  Total_sales
0    1980.0        Action         0.34
1    1980.0      Fighting         0.77
2    1980.0          Misc         2.71
3    1980.0       Shooter         7.07
4    1980.0        Sports         0.49
..      ...           ...          ...
384  2016.0        Sports        14.60
385  2016.0      Strategy         0.50
386  2017.0        Action         0.01
387  2017.0  Role-Playing         0.04
388  2020.0    Simulation         0.29

[389 rows x 3 columns]

In [27]:
data_genre = data.groupby(['Genre'], as_index= False).agg(Total_sales = ('Global_Sales','sum'))
data_genre['RankBySales'] = data_genre['Total_sales'].rank(ascending=False)
print(data_genre.sort_values('RankBySales'))

           Genre  Total_sales  RankBySales
0         Action      1751.18          1.0
10        Sports      1330.93          2.0
8        Shooter      1037.37          3.0
7   Role-Playing       927.37          4.0
4       Platform       831.37          5.0
3           Misc       809.96          6.0
6         Racing       732.04          7.0
2       Fighting       448.91          8.0
9     Simulation       392.20          9.0
5         Puzzle       244.95         10.0
1      Adventure       239.04         11.0
11      Strategy       175.12         12.0

In [33]:
# Filter
# select * from a where genre = 'Action'
data_genre.query("Genre == 'Action' ")
# Multiple rows 
data_genre.query("Genre in ['Action','Puzzle','Strategy'] ")

       Genre  Total_sales  RankBySales
0     Action      1751.18          1.0
5     Puzzle       244.95         10.0
11  Strategy       175.12         12.0

In [46]:
student = pd.DataFrame({'Id': [1,2,3,4], 'Name': ['Ram','Sita','Pooja','Ragu'] })
marks = pd.DataFrame({'Id':[1,1,2,2,3,3,2]
,'Subject':['E','M','E','M','E','S','P']
,'Marks':[20,30,40,50,60,20,40]
})

In [47]:
print(student)
print(marks)

   Id   Name
0   1    Ram
1   2   Sita
2   3  Pooja
3   4   Ragu
   Id Subject  Marks
0   1       E     20
1   1       M     30
2   2       E     40
3   2       M     50
4   3       E     60
5   3       S     20
6   2       P     40

In [57]:
student_marks = pd.merge(student,marks,on=['Id'],how='left')

In [58]:
student_marks

   Id   Name Subject  Marks
0   1    Ram       E   20.0
1   1    Ram       M   30.0
2   2   Sita       E   40.0
3   2   Sita       M   50.0
4   2   Sita       P   40.0
5   3  Pooja       E   60.0
6   3  Pooja       S   20.0
7   4   Ragu     NaN    NaN

In [63]:
student1 = pd.DataFrame({'Id': [1,2,3,4], 'Name': ['Ram','Sita','Pooja','Ragu'] })
student2 = pd.DataFrame({'Id': [5,6,7,8,8], 'Name': ['Rama','susi','animal','king','king'] })
print(student1)
print(student2)
print('\n')
student = pd.concat([student1,student2])
print(student.drop_duplicates())

   Id   Name
0   1    Ram
1   2   Sita
2   3  Pooja
3   4   Ragu
   Id    Name
0   5    Rama
1   6    susi
2   7  animal
3   8    king
4   8    king


   Id    Name
0   1     Ram
1   2    Sita
2   3   Pooja
3   4    Ragu
0   5    Rama
1   6    susi
2   7  animal
3   8    king

In [ ]:
student = pd.DataFrame({'Id': [1,2,3,4], 'Name': ['Ram','Sita','Pooja','Ragu'] })
marks = pd.DataFrame({'Id':[1,1,2,2,3,3,2]
,'Subject':['E','M','E','M','E','S','P']
,'Marks':[20,30,40,50,60,20,40]
})